using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Neckington.Helpers
{
    public static class LogoHelper
    {
        public static void ShowProgramName()
        {

            string[] logo = new[]

            {
        "███╗   ██╗███████╗ ██████╗██╗  ██╗██╗███╗   ██╗ ██████╗ ████████╗ ██████╗ ███╗   ██╗",
        "████╗  ██║██╔════╝██╔════╝██║ ██╔╝██║████╗  ██║██╔════╝ ╚══██╔══╝██╔═══██╗████╗  ██║",
        "██╔██╗ ██║█████╗  ██║     █████╔╝ ██║██╔██╗ ██║██║  ███╗   ██║   ██║   ██║██╔██╗ ██║",
        "██║╚██╗██║██╔══╝  ██║     ██╔═██╗ ██║██║╚██╗██║██║   ██║   ██║   ██║   ██║██║╚██╗██║",
        "██║ ╚████║███████╗╚██████╗██║  ██╗██║██║ ╚████║╚██████╔╝   ██║   ╚██████╔╝██║ ╚████║",
        "╚═╝  ╚═══╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝╚═╝  ╚═══╝ ╚═════╝    ╚═╝    ╚═════╝ ╚═╝  ╚═══╝",
        };

            Console.Clear();
            int top = (Console.WindowHeight - logo.Length) / 2;

            foreach (var line in logo)
            {
                int left = (Console.WindowWidth - line.Length) / 2;
                Console.SetCursorPosition(Math.Max(0, left), top++);
                Console.ForegroundColor = ConsoleColor.White;
                Console.WriteLine(line);
            }

            Console.ResetColor();
            Thread.Sleep(3000);
            Console.Clear();
        }
    }
}
